In [2]:
people = {  'last' : ['roronoa','roronoa','vinsmoke'], 
          'first'  : ['luffy','zoro','sanji'], 
         'age' : ['18','21','23']}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

       last  first age
0   roronoa  luffy  18
1   roronoa   zoro  21
2  vinsmoke  sanji  23

In [6]:
ab = df['last'] == 'roronoa'

In [7]:
filt = (df['last'] == 'roronoa') & (df['first'] == 'luffy')

In [8]:
df[filt]

      last  first age
0  roronoa  luffy  18

In [9]:
df.loc[filt, 'age']

0    18
Name: age, dtype: object

In [11]:
df[ab]

      last  first age
0  roronoa  luffy  18
1  roronoa   zoro  21